---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterPattern.Dispose
source: html/d6553ff4-ddab-93af-8121-27d4c447b64e.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.Dispose Method

Releases all resources used by the BalusterPattern

## Syntax (C#)
```csharp
public void Dispose()
```